{
    "type": "bundle",
    "id": "bundle--73df38ad-2c7e-46d9-a5c7-bfe034147ae9",
    "objects": [
        {
            "type": "identity",
            "spec_version": "2.1",
            "id": "identity--ccb69961-abfe-5ba1-810a-23eddd2a8578",
            "created": "2025-04-13T12:23:03.930364Z",
            "modified": "2025-04-13T12:23:03.930364Z",
            "name": "sila.ozeren@picussecurity.com (Sıla Özeren)",
            "identity_class": "individual"
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--1900fc79-ad3b-5ea7-b700-7245c895bc99",
            "created": "2025-04-13T12:23:03.931813Z",
            "modified": "2025-04-13T12:23:03.931813Z",
            "name": "Malvertising",
            "description": "Malvertising allows an adversary to purchase online advertisements that can be abused to distribute malware to victims. Ads can be purchased to plant as well as favorably position artifacts in specific locations online, such as prominently placed within search engine results. These ads may make it more difficult for users to distinguish between actual search results and advertisements. Purchased ads may also target specific audiences using the advertising network’s capabilities, potentially further taking advantage of the trust inherently given to search engines and popular websites.\n\nAdversaries may purchase ads and other resources to help distribute artifacts containing malicious code to victims. Purchased ads may attempt to impersonate or spoof well-known brands. For example, these spoofed ads may trick victims into clicking the ad which could then send them to a malicious domain that may be a clone of official websites containing trojanized versions of the advertised software. Adversary’s efforts to create malicious domains and purchase advertisements may also be automated at scale to better resist cleanup efforts.\n\nMalvertising may be used to support Drive-by Target and Drive-by Compromise, potentially requiring limited interaction from the user if the ad contains code/exploits that infect the target system's web browser.\n\nAdversaries may also employ several techniques to evade detection by the advertising network. For example, adversaries may dynamically route ad clicks to send automated crawler/policy enforcer traffic to benign sites while validating potential targets then sending victims referred from real ad clicks to malicious pages. This infection vector may therefore remain hidden from the ad network as well as any visitor not reaching the malicious sites with a valid identifier from clicking on the advertisement. Other tricks, such as intentional typos to avoid brand reputation monitoring, may also be used to evade automated detection.",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1583.008"
                }
            ]
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--8467d352-0562-5a16-88a9-69d233e6ca60",
            "created": "2025-04-13T12:23:03.9322Z",
            "modified": "2025-04-13T12:23:03.9322Z",
            "name": "Masquerading",
            "description": "Masquerading attack allows adversaries to manipulate features of their artifacts to make them appear legitimate or benign to users and/or security tools by making the name or location of an object, legitimate or malicious for the sake of evading defenses and observation. This may include manipulating file metadata, tricking users into misidentifying the file type, and giving legitimate task or service names. Renaming abusable system utilities to evade security monitoring is also a form of Masquerading.",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1036 "
                }
            ]
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--47f77060-bd97-52c6-8694-a7de3c4acbb5",
            "created": "2025-04-13T12:23:03.932382Z",
            "modified": "2025-04-13T12:23:03.932382Z",
            "name": "User Execution",
            "description": "User Execution attack may use social engineering to get users to execute malicious code by, for example, opening a malicious document file or link. These user actions will typically be observed as follow-on behavior from forms of Phishing.",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1204"
                }
            ]
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--66273cf7-2357-5bc2-af25-5d33c9f9a47a",
            "created": "2025-04-13T12:23:03.932601Z",
            "modified": "2025-04-13T12:23:03.932601Z",
            "name": "Spearphishing Link",
            "description": "Spearphishing Link is a phishing email attack that sends emails to specific & well-researched targets while purporting to be a trusted sender to entice them to click on a malicious link to a website that may compromise the user web browser using an exploit or prompts the user to download malicious applications, documents, zip files, or even executables.",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1566.002"
                }
            ]
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--bbea90c4-95c3-5759-981a-e66fd259d493",
            "created": "2025-04-13T12:23:03.932974Z",
            "modified": "2025-04-13T12:23:03.932974Z",
            "name": "Malicious File",
            "description": "Malicious File attack relies upon a user opening a malicious file (including doc, pdf, xls, rtf, scr, exe, lnk, pif, cpl, rar, etc.) in order to gain execution.",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1204.002"
                }
            ]
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--0644864a-132a-529a-9d97-35da5e7545a0",
            "created": "2025-04-13T12:23:03.933134Z",
            "modified": "2025-04-13T12:23:03.933134Z",
            "name": "AppleScript",
            "description": "AppleScript attack may abuse AppleScript to execute various behaviors, such as interacting with an open SSH connection, moving to remote machines, and even presenting users with fake dialog boxes.",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1059.002"
                }
            ]
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--7c9d2443-1903-56ff-9a78-e08428d0a214",
            "created": "2025-04-13T12:23:03.933275Z",
            "modified": "2025-04-13T12:23:03.933275Z",
            "name": "Input Capture",
            "description": "Input Capture attack uses various methods to capture user input to obtain credentials or collect information via login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. Credential API Hooking) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. Web Portal Capture).",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1056"
                }
            ]
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--87bf57bf-3210-525b-9704-39feb8be2907",
            "created": "2025-04-13T12:23:03.933409Z",
            "modified": "2025-04-13T12:23:03.933409Z",
            "name": "Obfuscated Files or Information",
            "description": "Obfuscated Files or Information attack uses encoding or encryption to change the signature & fingerprint of malicious code to bypass security software algorithms.",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1027"
                }
            ]
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--68de28ec-1c6c-5a4b-99f8-abfb97089ac8",
            "created": "2025-04-13T12:23:03.933542Z",
            "modified": "2025-04-13T12:23:03.933542Z",
            "name": "XOR Encoding",
            "description": "XOR Encoding technique uses the XOR multiplication encoding schemes to hide malicious code or to conceal stolen data ready for extraction."
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--371bc011-2a20-5b44-9306-694b5e524c73",
            "created": "2025-04-13T12:23:03.933636Z",
            "modified": "2025-04-13T12:23:03.933636Z",
            "name": "Keychain",
            "description": "Adversaries may collect the keychain storage data from a system to acquire credentials. Keychains are the built-in way for macOS to keep track of users' passwords and credentials for many services and features such as WiFi passwords, websites, secure notes, certificates, and Kerberos. Keychain files are located in ~/Library/Keychains/,/Library/Keychains/, and /Network/Library/Keychains/. [1] The security command-line utility, which is built into macOS by default, provides a useful way to manage these credentials.\n\nTo manage their credentials, users have to use additional credentials to access their keychain. If an adversary knows the credentials for the login keychain, then they can get access to all the other credentials stored in this vault. [2] By default, the passphrase for the keychain is the user’s logon credentials.",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1555.001"
                }
            ]
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--a6ffbfa6-092a-5109-8dd3-e675a3500d73",
            "created": "2025-04-13T12:23:03.933765Z",
            "modified": "2025-04-13T12:23:03.933765Z",
            "name": "System Information Discovery",
            "description": "System Information Discovery attack is used by an adversary to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture to shape follow-on attack steps including whether or not to fully infect the target and/or attempts other specific actions.",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1082"
                }
            ]
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--2ade1634-39d7-54fa-8179-bdf1e13643da",
            "created": "2025-04-13T12:23:03.933892Z",
            "modified": "2025-04-13T12:23:03.933892Z",
            "name": "Local Data Staging",
            "description": "Adversaries may stage collected data in a central location or directory on the local system prior to Exfiltration. Data may be kept in separate files or combined into one file through techniques such as Archive Collected Data. Interactive command shells may be used, and common functionality within cmd and bash may be used to copy data into a staging location.",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1074.001"
                }
            ]
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--934e513a-c90f-5548-b828-01cf8f73f979",
            "created": "2025-04-13T12:23:03.934019Z",
            "modified": "2025-04-13T12:23:03.934019Z",
            "name": "Steal Web Session Cookie",
            "description": "Steal Web Session Cookie attack allows an adversary to steal web application or service session cookies and use them to gain access web applications or Internet services as an authenticated user without needing credentials.",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1539"
                }
            ]
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--e0ae0821-1fd6-52b2-88eb-7b40cba6c272",
            "created": "2025-04-13T12:23:03.934145Z",
            "modified": "2025-04-13T12:23:03.934145Z",
            "name": "File and Directory Discovery",
            "description": "File and Directory Discovery attack enumerates files & directories or search in specific locations of a host or network share for certain information within a file system during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions. Attackers use command shell utilities like dir, tree, ls, find, and locate.",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1083"
                }
            ]
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--af6285ee-5fb3-5b06-9d03-4a9b44c64bfd",
            "created": "2025-04-13T12:23:03.93427Z",
            "modified": "2025-04-13T12:23:03.93427Z",
            "name": "Exfiltration Over C2 Channel",
            "description": "Exfiltration Over C2 Channel attack steals data by exfiltrating it over an existing command and control channel. Stolen data is encoded into the normal communications channel using the same protocol as command and control communications.",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1041"
                }
            ]
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--27a824d2-33de-5b65-bb5a-a5e31ac1b94d",
            "created": "2025-04-13T12:23:03.934398Z",
            "modified": "2025-04-13T12:23:03.934398Z",
            "name": "Data from Local System",
            "description": "Data from Local System attack allows adversaries to search local system sources, such as file systems or local databases, to find files of interest and sensitive data prior to Exfiltration. Adversaries can use a Command and Scripting Interpreter, such as cmd, or use Automated Collection on the local system.",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1005"
                }
            ]
        },
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--c238c92e-c3b7-5a47-b144-c24498e58a3a",
            "created": "2025-04-13T12:23:03.934528Z",
            "modified": "2025-04-13T12:23:03.934528Z",
            "name": "GUI Input Capture",
            "description": "GUI Input Capture allows adversaries to mimic common operating system GUI components to prompt users for credentials with a seemingly legitimate prompt. When programs are executed that need additional privileges than are present in the current user context, it is common for the operating system to prompt the user for proper credentials to authorize the elevated privileges for the task (ex: Bypass User Account Control).\n\nAdversaries may mimic this functionality to prompt users for credentials with a seemingly legitimate prompt for a number of reasons that mimic normal usage, such as a fake installer requiring additional access or a fake malware removal suite.[1] This type of prompt can be used to collect credentials via various languages such as AppleScript and PowerShell.",
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1056.002"
                }
            ]
        },
        {
            "type": "malware",
            "spec_version": "2.1",
            "id": "malware--e0b6810f-4ede-5953-afb9-7873c9bfb791",
            "created": "2025-04-13T12:23:03.934697Z",
            "modified": "2025-04-13T12:23:03.934697Z",
            "name": "Atomic macOS Stealer AMOS (Info Stealer)",
            "description": "The malware is specifically designed to target macOS and can steal sensitive information from the victim’s machine. The Atomic macOS Stealer can steal various types of information from the victim’s machine, including keychain passwords, complete system information, files from the desktop and documents folder, and even the macOS password. The stealer is designed to target multiple browsers and can extract auto-fills, passwords, cookies, wallets, and credit card information. Specifically, AMOS can target cryptowallets such as Electrum, Binance, Exodus, Atomic, and Coinomi.",
            "is_family": false
        },
        {
            "type": "indicator",
            "spec_version": "2.1",
            "id": "indicator--a46d9234-5734-5983-ba42-a2df9c242cad",
            "created": "2025-04-13T12:23:03.938763Z",
            "modified": "2025-04-13T12:23:03.938763Z",
            "name": "IP: 193.233.132.188",
            "description": "TruKno IP indicator",
            "indicator_types": [
                "malicious-activity"
            ],
            "pattern": "[ipv4-addr:value = '193.233.132.188']",
            "pattern_type": "stix",
            "pattern_version": "2.1",
            "valid_from": "2025-04-12T13:29:58Z"
        },
        {
            "type": "indicator",
            "spec_version": "2.1",
            "id": "indicator--a09705ff-05db-5a0e-ab2e-6f19d209dc2d",
            "created": "2025-04-13T12:23:03.939975Z",
            "modified": "2025-04-13T12:23:03.939975Z",
            "name": "IP: 46.101.104.172",
            "description": "TruKno IP indicator",
            "indicator_types": [
                "malicious-activity"
            ],
            "pattern": "[ipv4-addr:value = '46.101.104.172']",
            "pattern_type": "stix",
            "pattern_version": "2.1",
            "valid_from": "2025-04-12T13:29:58Z"
        },
        {
            "type": "report",
            "spec_version": "2.1",
            "id": "report--b0a8e7b1-c271-5590-aabc-a2806fa96b5e",
            "created": "2025-04-13T12:23:03.940657Z",
            "modified": "2025-04-13T12:23:03.940657Z",
            "name": "Atomic Stealer: Dissecting 2024's Most Notorious macOS Infostealer",
            "description": "Discover how Atomic Stealer (AMOS) targets macOS users, steals credentials and data, and how to detect, prevent, and validate against its TTPs.",
            "published": "2025-04-12T13:29:58Z",
            "object_refs": [
                "identity--ccb69961-abfe-5ba1-810a-23eddd2a8578",
                "attack-pattern--1900fc79-ad3b-5ea7-b700-7245c895bc99",
                "attack-pattern--8467d352-0562-5a16-88a9-69d233e6ca60",
                "attack-pattern--47f77060-bd97-52c6-8694-a7de3c4acbb5",
                "attack-pattern--66273cf7-2357-5bc2-af25-5d33c9f9a47a",
                "attack-pattern--bbea90c4-95c3-5759-981a-e66fd259d493",
                "attack-pattern--0644864a-132a-529a-9d97-35da5e7545a0",
                "attack-pattern--7c9d2443-1903-56ff-9a78-e08428d0a214",
                "attack-pattern--87bf57bf-3210-525b-9704-39feb8be2907",
                "attack-pattern--68de28ec-1c6c-5a4b-99f8-abfb97089ac8",
                "attack-pattern--371bc011-2a20-5b44-9306-694b5e524c73",
                "attack-pattern--a6ffbfa6-092a-5109-8dd3-e675a3500d73",
                "attack-pattern--2ade1634-39d7-54fa-8179-bdf1e13643da",
                "attack-pattern--934e513a-c90f-5548-b828-01cf8f73f979",
                "attack-pattern--e0ae0821-1fd6-52b2-88eb-7b40cba6c272",
                "attack-pattern--af6285ee-5fb3-5b06-9d03-4a9b44c64bfd",
                "attack-pattern--27a824d2-33de-5b65-bb5a-a5e31ac1b94d",
                "attack-pattern--c238c92e-c3b7-5a47-b144-c24498e58a3a",
                "malware--e0b6810f-4ede-5953-afb9-7873c9bfb791",
                "indicator--a46d9234-5734-5983-ba42-a2df9c242cad",
                "indicator--a09705ff-05db-5a0e-ab2e-6f19d209dc2d"
            ],
            "labels": [
                "macOS (Endpoint OS)",
                "Endpoint Security",
                "Phishing Attacks"
            ],
            "external_references": [
                {
                    "source_name": "Picus Security",
                    "url": "https://www.picussecurity.com/resource/blog/atomic-stealer-amos-macos-threat-analysis"
                }
            ]
        }
    ]
}